# Agregar datos y hacer operaciones con ellos.

A continuación seguimores con a misma tabla, pero haremos un par de operaciones con ellos.

In [1]:
%load_ext sql
%sql sqlite://

# Paso 1: Creamos una base de datos.

In [3]:
%%sql
CREATE TABLE groceries (
  id INTEGER PRIMARY KEY,
  product_name TEXT,
  quantity INTEGER,
  price REAL,
  aisle INTEGER
);

INSERT INTO groceries (product_name, quantity, price, aisle)
VALUES
  ('Tomatoes', 5, 0.99, 3),
  ('Apples', 3, 1.49, 1),
  ('Bananas', 6, 0.79, 1),
  ('Carrots', 2, 0.59, 3),
  ('Onions', 1, 0.49, 3),
  ('Lettuce', 1, 0.99, 2),
  ('Potatoes', 5, 0.99, 3),
  ('Bread', 1, 2.49, 4),
  ('Milk', 1, 3.49, 5),
  ('Eggs', 12, 2.99, 5);

 * sqlite://
Done.
10 rows affected.

[]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Paso 2: Visualizaremos la base de datos.

Recuerda la sintaxis básica para visualizar una tabla, utilizala acontinuación para **groceries**

In [4]:
%%sql
SELECT * FROM groceries

 * sqlite://
Done.

[(1, 'Tomatoes', 5, 0.99, 3),
 (2, 'Apples', 3, 1.49, 1),
 (3, 'Bananas', 6, 0.79, 1),
 (4, 'Carrots', 2, 0.59, 3),
 (5, 'Onions', 1, 0.49, 3),
 (6, 'Lettuce', 1, 0.99, 2),
 (7, 'Potatoes', 5, 0.99, 3),
 (8, 'Bread', 1, 2.49, 4),
 (9, 'Milk', 1, 3.49, 5),
 (10, 'Eggs', 12, 2.99, 5)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Paso 3: Insertar nuevos datos en la tabla.

A continuación dos nuevos registros en la tabla para que los explores.

<div style="border-left: 5px solid #f0ad4e; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Nota Aclaratoria</h5>

<p>Encontrarás sintaxis diferentes en las actividades de Khan Academy, pero tienen el mismo resultado, recuerda que siempre tendrás que cambiar de lenguajes y versiones de bases de datos, pero la lógica no cambiará.</p>

</div>

In [5]:
%%sql
INSERT INTO groceries (product_name, quantity, price, aisle)
VALUES
  ('Peaches', 4, 1.99, 3),
  ('Cereal', 1, 4.99, 4);

 * sqlite://
2 rows affected.

[]

# Paso 4: Visualizaremos la base de datos.

Volveremos a visualizar la tabla **groceries** para ver el resultado de ingresar nuevos datos.

In [6]:
%%sql
SELECT * FROM groceries

 * sqlite://
Done.

[(1, 'Tomatoes', 5, 0.99, 3),
 (2, 'Apples', 3, 1.49, 1),
 (3, 'Bananas', 6, 0.79, 1),
 (4, 'Carrots', 2, 0.59, 3),
 (5, 'Onions', 1, 0.49, 3),
 (6, 'Lettuce', 1, 0.99, 2),
 (7, 'Potatoes', 5, 0.99, 3),
 (8, 'Bread', 1, 2.49, 4),
 (9, 'Milk', 1, 3.49, 5),
 (10, 'Eggs', 12, 2.99, 5),
 (11, 'Peaches', 4, 1.99, 3),
 (12, 'Cereal', 1, 4.99, 4)]

# Paso 5: Utilización de la sentencia SUM

**SUM** es una función en **SQL** que devuelve la suma de un conjunto de valores.

Aquí hay un ejemplo de cómo usar **SUM** en una instrucción **SELECT:**

```sql
SELECT SUM(nombre_columna)
FROM nombre_tabla
WHERE condición;

```

Esto devolverá la suma de todos los valores en la columna nombre_columna, de las filas en la tabla nombre_tabla que cumplan con la condición especificada en la cláusula WHERE.

Por ejemplo, si tienes una tabla llamada "pedidos" con una columna llamada "cantidad_total", puedes usar la siguiente consulta para obtener la suma de todos los pedidos de la tabla:

```sql
SELECT SUM(cantidad_total)
FROM pedidos;


```

También puedes usar SUM en combinación con GROUP BY para obtener la suma de valores para cada grupo. Por ejemplo:

```sql
SELECT columna_grupo, SUM(columna_valor)
FROM nombre_tabla
GROUP BY columna_grupo;
```

Esto devolverá la suma de columna_valor para cada valor único en columna_grupo.

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Aplicación.</h5>

<p>Bien, ahora sumaremos cuantos abarrotes en total se tienen en la tienda.</p>

    
</div>

In [ ]:
%%sql
SELECT SUM(quantity) FROM groceries;

# Paso 6: Utilización de la sentencia MAX

La función MAX es una función de agregación en SQL que se utiliza para devolver el valor máximo de una columna en un conjunto de resultados. Por ejemplo, si tienes una tabla con una columna llamada "edad" que contiene los valores 20, 25, 30, 35, la sentencia MAX devolvería el valor 35. La sintaxis para usar la función MAX es la siguiente:

```sql
SELECT MAX(columna)
FROM tabla
```

Donde "columna" es el nombre de la columna para la cual quieres obtener el valor máximo y "tabla" es el nombre de la tabla que contiene la columna.

Por ejemplo, si quisieras obtener el valor máximo de la columna "edad" en la tabla "personas", la consulta sería:

SELECT MAX(edad)
FROM personas

También puedes usar la función MAX junto con otros criterios de selección, como WHERE y GROUP BY, para limitar los resultados de la consulta. Por ejemplo, si quisieras obtener el valor máximo de la columna "edad" para todas las personas que tienen más de 30 años, la consulta sería:

```sql
SELECT MAX(edad)
FROM personas
WHERE edad > 30
```

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Aplicación.</h5>

<p>Bien, ahora obtendremos el aborrote del que más existencia tenemos utilizando el comando MAX</p>

    
</div>

In [ ]:
%%sql
SELECT MAX(quantity) FROM groceries;

# Paso 7: Utilización de la sentencia MIN

La función MIN es una función de agregación en SQL que se utiliza para devolver el valor mínimo de una columna en un conjunto de resultados. Por ejemplo, si tienes una tabla con una columna llamada "edad" que contiene los valores 20, 25, 30, 35, la sentencia MIN devolvería el valor 20. La sintaxis para usar la función MIN es la siguiente:

```sql
SELECT MIN(columna)
FROM tabla

```

Donde "columna" es el nombre de la columna para la cual quieres obtener el valor mínimo y "tabla" es el nombre de la tabla que contiene la columna.

Por ejemplo, si quisieras obtener el valor mínimo de la columna "edad" en la tabla "personas", la consulta sería:

```sql
SELECT MIN(edad)
FROM personas
```

También puedes usar la función MIN junto con otros criterios de selección, como WHERE y GROUP BY, para limitar los resultados de la consulta. Por ejemplo, si quisieras obtener el valor mínimo de la columna "edad" para todas las personas que tienen más de 30 años, la consulta sería:

```sql
SELECT MIN(edad)
FROM personas
WHERE edad > 30
```

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Aplicación.</h5>

<p>Bien, ahora obtendremos el aborrote del que más existencia tenemos utilizando el comando MAX</p>

    
</div>

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Ejercicio

Aplica la sentencia MIN en la tabla de abarrotes para sacar cuál es el producto del que su existencia es menor.

In [ ]:
%%sql
SELECT MIN(quantity) FROM groceries;

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Paso 8: Agrupar por pasillo y sumar la cantidad de abarrotes en cada pasillo.

In [7]:
%%sql
SELECT SUM(quantity) FROM groceries GROUP BY aisle;

 * sqlite://
Done.

[(9,), (1,), (17,), (2,), (13,)]

<div style="border-left: 5px solid #04E720; padding:1.25rem; border-right: 1px solid #eee;  border-top: 1px solid #eee;  border-bottom: 1px solid #eee;">

<h5 id="ensure-correct-role-and-provide-a-label">Explicación: </h5>

Esta consulta SELECT devuelve la suma total de la cantidad de productos en cada pasillo de una tabla de compras llamada "groceries".

La cláusula SELECT indica qué se debe seleccionar, en este caso, la función de agregación SUM() se aplica a la columna "cantidad" para calcular la suma total de cantidades para cada pasillo.

La cláusula FROM especifica la tabla de la que se deben seleccionar los datos, en este caso, la tabla "groceries".

La cláusula GROUP BY agrupa los resultados de la consulta por el valor de la columna especificada, en este caso, "pasillo". Esto significa que se calculará la suma total de cantidades para cada valor único en la columna "pasillo".

La consulta completa devolvería un conjunto de resultados con una fila por cada valor único en la columna "pasillo" y una columna que muestra la suma total de cantidades para ese pasillo.


    
</div>

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Ejercicio 

Agrega el campo del pasillo y la cantidad total de productos en cada pasillo

In [9]:
%%sql
SELECT aisle, SUM(quantity) FROM groceries GROUP BY aisle;

 * sqlite://
Done.

[(1, 9), (2, 1), (3, 17), (4, 2), (5, 13)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Paso 9: Seleccionar más columnas para nuestra consulta.

En el siguiente paso vamos colocar las columnas del productos, el pasillo y la cantidad

In [10]:
%%sql
SELECT product_name, aisle, SUM(quantity) FROM groceries GROUP BY aisle;

 * sqlite://
Done.

[('Apples', 1, 9),
 ('Lettuce', 2, 1),
 ('Tomatoes', 3, 17),
 ('Bread', 4, 2),
 ('Milk', 5, 13)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Ejercicio 

Notaras que solo aparece el primer producto de la columna product_name de los abarrotes, para lograr que aparezcan todos los productos busca el uso de la sentencia CONCAT.

In [13]:
%%sql
SELECT GROUP_CONCAT(product_name, ', ') as product_name, aisle, SUM(quantity)
FROM groceries
GROUP BY aisle

 * sqlite://
Done.

[('Apples, Bananas', 1, 9),
 ('Lettuce', 2, 1),
 ('Tomatoes, Carrots, Onions, Potatoes, Peaches', 3, 17),
 ('Bread, Cereal', 4, 2),
 ('Milk, Eggs', 5, 13)]

# Paso 10: Explicación de GROUP_CONCAT()

La función GROUP_CONCAT() es una función de agregación en SQL que se utiliza para concatenar los valores de una columna en una sola cadena separada por un separador especificado. La sintaxis para utilizar GROUP_CONCAT() es la siguiente:

```sql
SELECT GROUP_CONCAT(columna, separador) as nombre_columna
FROM tabla
GROUP BY columna_agrupamiento

```

Donde "columna" es el nombre de la columna que quieres concatenar, "separador" es el separador que se debe utilizar para separar los valores concatenados y "nombre_columna" es el nombre que se le asignará a la columna de resultados. "columna_agrupamiento" es la columna por la cual se deben agrupar los resultados.

Por ejemplo, si tienes una tabla con una columna "nombre" que contiene los valores "Juan", "Pedro" y "Mario", y quieres concatenar estos valores en una sola cadena separada por comas, la consulta sería:

```sql
SELECT GROUP_CONCAT(nombre, ', ') as nombres
FROM tabla

```

Esto devolvería una columna "nombres" con el valor "Juan, Pedro, Mario".

Si quieres agrupar los resultados por otra columna, por ejemplo, por "edad", la consulta sería:

```sql
SELECT GROUP_CONCAT(nombre, ', ') as nombres, edad
FROM tabla
GROUP BY edad
```

Esto devolvería una fila por cada edad con los nombres de todas las personas de esa edad concatenados en la primera columna y la edad en la segunda columna.